## Production: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                     |
|--------|----------------------------------------------|
| add    | `aws_ssm_parameter.azure_openai_api_key`     |
|        | `aws_ssm_parameter.azure_openai_api_version` |
|        | `aws_ssm_parameter.azure_openai_endpoint`    |
|        | `aws_ssm_parameter.canada_ca_search_api_key` |
|        | `aws_ssm_parameter.canada_ca_search_uri`     |
|        | `aws_ssm_parameter.docdb_password`           |
|        | `aws_ssm_parameter.docdb_username`           |
|        | `aws_ssm_parameter.google_ai_api_key`        |
|        | `aws_ssm_parameter.google_search_engine_id`  |
|        | `aws_ssm_parameter.jwt_secret_key`           |
|        | `aws_ssm_parameter.user_agent`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.azure_openai_api_key will be created
  + resource "aws_ssm_parameter" "azure_openai_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "azure_openai_api_key"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.azure_openai_api_version will be created
  + resource "aws_ssm_parameter" "azure_openai_api_version" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "azure_openai_api_version"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.azure_openai_endpoint will be created
  + resource "aws_ssm_parameter" "azure_openai_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "azure_openai_endpoint"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.canada_ca_search_api_key will be created
  + resource "aws_ssm_parameter" "canada_ca_search_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "canada_ca_search_api_key"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.canada_ca_search_uri will be created
  + resource "aws_ssm_parameter" "canada_ca_search_uri" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "canada_ca_search_uri"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.docdb_password will be created
  + resource "aws_ssm_parameter" "docdb_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "docdb_password"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.docdb_username will be created
  + resource "aws_ssm_parameter" "docdb_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "docdb_username"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.google_ai_api_key will be created
  + resource "aws_ssm_parameter" "google_ai_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "google_ai_api_key"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.google_search_engine_id will be created
  + resource "aws_ssm_parameter" "google_search_engine_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "google_search_engine_id"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.jwt_secret_key will be created
  + resource "aws_ssm_parameter" "jwt_secret_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "jwt_secret_key"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.user_agent will be created
  + resource "aws_ssm_parameter" "user_agent" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "user_agent"
      + tags           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azure_openai_api_key_arn     = (known after apply)
  + azure_openai_api_version_arn = (known after apply)
  + azure_openai_endpoint_arn    = (known after apply)
  + canada_ca_search_api_key_arn = (known after apply)
  + canada_ca_search_uri_arn     = (known after apply)
  + docdb_password_arn           = (known after apply)
  + docdb_password_name          = "docdb_password"
  + docdb_username_arn           = (known after apply)
  + docdb_username_name          = "docdb_username"
  + google_ai_api_key_arn        = (known after apply)
  + google_search_engine_id_arn  = (known after apply)
  + jwt_secret_key_arn           = (known after apply)
  + user_agent_arn               = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
